haskell.org
#+TITLE:Haskell
#+OPTIONS: num:nil
#+SETUPFILE: /home/silin/.emacs.d/org-html-themes/org/theme-bigblow.setup
#+startup:  content
* commands
** in file.hs
C-c C-l  to execute file.hs and go to interactive environment 
Seeing ./black.hs
** C-c C-c call in src
#+begin_src haskell   :results value :eval (inferior-haskell-start-process)
#+begin_src haskell  :results value :eval (inferior-haskell-start-process)
  log2 :: Float -> Float
    log2 = logBase 2
    log2 43

#+end_src

#+RESULTS:
: Prelude> 5.426264754702098

#+end_src
in src can multi functions be defined. and the last call will be printed

with follow extension, can be easy C-c C-c executed, but not in send
to haskell log file, but only output the last result


Seeing Literatur Programm Grundlage
** send to haskell/org-src-block

#+begin_src haskell
#+begin_src haskell  :results value :eval (inferior-haskell-start-process)
  log2 :: Float -> Float
    log2 = logBase 2
    log2 43

#+end_src

#+RESULTS:
: Prelude> 5.426264754702098




#+end_src

first to load file. ~/.emacs.d/packages/orgmode-babal-haskell.el
in one of src block M-x : send to haskell/org-src-block

in src block  without any extension can be load in send buffer(after
_src haskell), and the be called function can be many type.
 
important : in src block the calling syntax is NOT allowed

Seeing Literatur Programm Alternativen
* Functional Programm
** Grundlage
basic function call
#+begin_src haskell  :results value :eval (inferior-haskell-start-process)
  log2 :: Float -> Float
    log2 = logBase 2
    log2 43

#+end_src

#+RESULTS:
: 5.426264754702098

implication
#+begin_src haskell  :results value :eval (inferior-haskell-start-process)

  (==>):: Bool -> Bool -> Bool
  a ==> b = not a || not b
  Flase ==> True
  False==> False
  True ==> True

#+end_src

#+RESULTS:
: False

--euler numbers
#+begin_src haskell  :results value :eval (inferior-haskell-start-process)

  e:: Float
  e = exp 1
  e 
#+end_src

#+RESULTS:
: Prelude> 2.718281828459045

** Pattern Matching

one of the calling must match one case of pattern
#+begin_src haskell 
  (<#>) :: Bool -> Bool -> Bool
    (<#>) False False = False
    (<#>) False True = True
    (<#>) True False = True
    (<#>) True True = True


  True <#> True
    #+end_src

#+RESULTS:
: Prelude> Prelude> Prelude> Prelude> Prelude> Prelude> True


#+begin_src  haskell  :results value :eval (inferior-haskell-start-process)

  (<#>) :: Bool -> Bool -> Bool
    (<#>) True True = True
    (<#>) _ _ = False

  (<#>) True True
  (<#>) False True

#+end_src

#+RESULTS:
: False

#+begin_src haskell
  (<#>) :: Bool -> Bool -> Bool
    (<#>) True True 

#+end_src

#+RESULTS:
: True

case : this can only be executed in a .hs file,
 in orgmode can NOT be imported, I don't know what is going on
 in Terminal can NOT also

Here I made above mistake, this is no sense.
so long the indentation is correct, so works

#+begin_src haskell 
  (<#>) :: Bool -> Bool -> Bool
  (<#>) a b
    | a == b = False
    | otherwise = True


#+end_src

#+RESULTS:
: <interactive>:48:3: error: parse error on input ‘|’

** Alternativen

if else then
#+begin_src haskell 
  absolute :: Int -> Int
  absolute x = if x < 0 then -x else x

#+end_src

#+RESULTS:
: <interactive>:50:1-8: error:
:     Variable not in scope: absolute :: Int -> Int

