haskell.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-11-23 Mo 20:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Haskell</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="silin" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/hideshow.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Haskell</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd3654ec">commands</a>
<ul>
<li><a href="#org5389421">in file.hs</a></li>
<li><a href="#org03f9e3a">C-c C-c call in src</a></li>
<li><a href="#org09780f9">send to haskell/org-src-block</a></li>
</ul>
</li>
<li><a href="#org181d995">Functional Programm</a>
<ul>
<li><a href="#org17b0620">Grundlage</a></li>
<li><a href="#org1f68291">Pattern Matching</a></li>
<li><a href="#orge0e9598">Alternativen</a></li>
<li><a href="#orga4b6e99">Recursion</a></li>
<li><a href="#orge66aa05">Type conversion1</a></li>
<li><a href="#org8473008">Factorial</a></li>
<li><a href="#org8c49b4b">Stern Brocot Floge</a></li>
</ul>
</li>
<li><a href="#orgac1894a">List</a>
<ul>
<li><a href="#orgf61c07f">List  add</a></li>
</ul>
</li>
<li><a href="#org9960d3b">Symbol</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgd3654ec" class="outline-2">
<h2 id="orgd3654ec">commands</h2>
<div class="outline-text-2" id="text-orgd3654ec">
</div>
<div id="outline-container-org5389421" class="outline-3">
<h3 id="org5389421">in file.hs</h3>
<div class="outline-text-3" id="text-org5389421">
<p>
C-c C-l  to execute file.hs and go to interactive environment 
Seeing ./black.hs
</p>
</div>
</div>
<div id="outline-container-org03f9e3a" class="outline-3">
<h3 id="org03f9e3a">C-c C-c call in src</h3>
<div class="outline-text-3" id="text-org03f9e3a">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #bc6ec5;">#+begin_src haskell  :results value :eval (inferior-haskell-start-process)</span>
  log2 <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Float</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Float</span>
    log2 <span style="color: #7590db;">=</span> logBase 2
    log2 43

</pre>
</div>

<p>
#+end<sub>src</sub>
in src can multi functions be defined. and the last call will be printed
</p>

<p>
with follow extension, can be easy C-c C-c executed, but not in send
to haskell log file, but only output the last result
</p>


<p>
Seeing Literatur Programm Grundlage
</p>
</div>
</div>
<div id="outline-container-org09780f9" class="outline-3">
<h3 id="org09780f9">send to haskell/org-src-block</h3>
<div class="outline-text-3" id="text-org09780f9">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #bc6ec5;">#+begin_src haskell  :results value :eval (inferior-haskell-start-process)</span>
  log2 <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Float</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Float</span>
    log2 <span style="color: #7590db;">=</span> logBase 2
    log2 43

</pre>
</div>




<p>
#+end<sub>src</sub>
</p>

<p>
first to load file. ~/.emacs.d/packages/orgmode-babal-haskell.el
in one of src block M-x : send to haskell/org-src-block
</p>

<p>
in src block  without any extension can be load in send buffer(after
_src haskell), and the be called function can be many type.
</p>

<p>
important : in src block the calling syntax is NOT allowed
</p>

<p>
Seeing Literatur Programm Alternativen
</p>
</div>
</div>
</div>
<div id="outline-container-org181d995" class="outline-2">
<h2 id="org181d995">Functional Programm</h2>
<div class="outline-text-2" id="text-org181d995">
</div>
<div id="outline-container-org17b0620" class="outline-3">
<h3 id="org17b0620">Grundlage</h3>
<div class="outline-text-3" id="text-org17b0620">
<p>
basic function call
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #bc6ec5; font-weight: bold;">log2</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Float</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Float</span>
  log2 <span style="color: #7590db;">=</span> logBase 2
  log2 43

</pre>
</div>

<p>
implication
</p>
<div class="org-src-container">
<pre class="src src-haskell">
(<span style="color: #bc6ec5; font-weight: bold;">==&gt;</span>)<span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Bool</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Bool</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Bool</span>
<span style="color: #bc6ec5; font-weight: bold;">a</span> <span style="color: #bc6ec5; font-weight: bold;">==&gt;</span> b <span style="color: #7590db;">=</span> not a <span style="color: #7590db;">||</span> not b
<span style="color: #ce537a; font-weight: bold;">Flase</span> <span style="color: #bc6ec5; font-weight: bold;">==&gt;</span> <span style="color: #ce537a; font-weight: bold;">True</span>
<span style="color: #ce537a; font-weight: bold;">False</span><span style="color: #bc6ec5; font-weight: bold;">==&gt;</span> <span style="color: #ce537a; font-weight: bold;">False</span>
<span style="color: #ce537a; font-weight: bold;">True</span> <span style="color: #bc6ec5; font-weight: bold;">==&gt;</span> <span style="color: #ce537a; font-weight: bold;">True</span>

</pre>
</div>

<p>
&#x2013;euler numbers
</p>
<div class="org-src-container">
<pre class="src src-haskell">
e<span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Float</span>
<span style="color: #bc6ec5; font-weight: bold;">e</span> <span style="color: #7590db;">=</span> exp 1
e 
</pre>
</div>
</div>
</div>

<div id="outline-container-org1f68291" class="outline-3">
<h3 id="org1f68291">Pattern Matching</h3>
<div class="outline-text-3" id="text-org1f68291">
<p>
one of the calling must match one case of pattern
</p>
<div class="org-src-container">
<pre class="src src-haskell">(<span style="color: #bc6ec5; font-weight: bold;">&lt;#&gt;</span>) <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Bool</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Bool</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Bool</span>
  (<span style="color: #7590db;">&lt;#&gt;</span>) <span style="color: #ce537a; font-weight: bold;">False</span> <span style="color: #ce537a; font-weight: bold;">False</span> <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">False</span>
  (<span style="color: #7590db;">&lt;#&gt;</span>) <span style="color: #ce537a; font-weight: bold;">False</span> <span style="color: #ce537a; font-weight: bold;">True</span> <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">True</span>
  (<span style="color: #7590db;">&lt;#&gt;</span>) <span style="color: #ce537a; font-weight: bold;">True</span> <span style="color: #ce537a; font-weight: bold;">False</span> <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">True</span>
  (<span style="color: #7590db;">&lt;#&gt;</span>) <span style="color: #ce537a; font-weight: bold;">True</span> <span style="color: #ce537a; font-weight: bold;">True</span> <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">True</span>


<span style="color: #ce537a; font-weight: bold;">True</span> <span style="color: #bc6ec5; font-weight: bold;">&lt;#&gt;</span> <span style="color: #ce537a; font-weight: bold;">True</span>
</pre>
</div>


<div class="org-src-container">
<pre class="src src-haskell">
(<span style="color: #bc6ec5; font-weight: bold;">&lt;#&gt;</span>) <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Bool</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Bool</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Bool</span>
  (<span style="color: #7590db;">&lt;#&gt;</span>) <span style="color: #ce537a; font-weight: bold;">True</span> <span style="color: #ce537a; font-weight: bold;">True</span> <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">True</span>
  (<span style="color: #7590db;">&lt;#&gt;</span>) <span style="color: #4f97d7; font-weight: bold;">_</span> <span style="color: #4f97d7; font-weight: bold;">_</span> <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">False</span>

(<span style="color: #bc6ec5; font-weight: bold;">&lt;#&gt;</span>) <span style="color: #ce537a; font-weight: bold;">True</span> <span style="color: #ce537a; font-weight: bold;">True</span>
(<span style="color: #bc6ec5; font-weight: bold;">&lt;#&gt;</span>) <span style="color: #ce537a; font-weight: bold;">False</span> <span style="color: #ce537a; font-weight: bold;">True</span>

</pre>
</div>

<div class="org-src-container">
<pre class="src src-haskell">(<span style="color: #bc6ec5; font-weight: bold;">&lt;#&gt;</span>) <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Bool</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Bool</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Bool</span>
  (<span style="color: #7590db;">&lt;#&gt;</span>) <span style="color: #ce537a; font-weight: bold;">True</span> <span style="color: #ce537a; font-weight: bold;">True</span> 

</pre>
</div>

<p>
case : this can only be executed in a .hs file,
 in orgmode can NOT be imported, I don't know what is going on
 in Terminal can NOT also
</p>

<p>
Here I made above mistake, this is no sense.
so long the indentation is correct, so works
</p>

<div class="org-src-container">
<pre class="src src-haskell">(<span style="color: #bc6ec5; font-weight: bold;">&lt;#&gt;</span>) <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Bool</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Bool</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Bool</span>
(<span style="color: #bc6ec5; font-weight: bold;">&lt;#&gt;</span>) a b
  <span style="color: #7590db;">|</span> a <span style="color: #7590db;">==</span> b <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">False</span>
  <span style="color: #7590db;">|</span> otherwise <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">True</span>


</pre>
</div>
</div>
</div>
