haskell.org
** Recursion
easy fib
#+begin_src haskell
  heronA ::(Int, Double) -> Double
  heronA (n,a)
    | n > 0     = (heronA(n-1,a) + a/heronA(n-1, a))/2
    | otherwise = a

  absolute :: Int -> Int
  absolute x = if x < 0 then -x else x

  heronB :: Int -> Double -> Double
  heronB n a
    | n > 0     = (heronB (n-1) a + a/heronB(n-1) a)/2
    | otherwise = a

#+end_src

#+RESULTS:
: <interactive>:70:3: error: parse error on input ‘|’


where 
#+begin_src haskell
  heronC :: Int -> Double -> Double
  heronC n a
    |n > 0      = (x + a/x)/2
    |otherwise  = a
    where x = heronC (n-1) a
#+end_src

#+RESULTS:
: <interactive>:79:3-7: error: parse error on input ‘where’

fib & where

#+begin_src haskell
  fibA :: Int -> Int
  fibA n
    |n == 0    = 0
    |n == 1    = 1
    |otherwise = x +y
    where
      x = fibA (n-1)
      y = fibA (n-2)
 
#+end_src

#+RESULTS:
: <interactive>:88:9-12: error:
:     Variable not in scope: fibA :: Integer -> t
: 
: <interactive>:88:15: error: Variable not in scope: n :: Integer

fib & where & pattern matching

#+begin_src  haskell
  fibB :: Int -> Int
  fibB 0 = 0
  fibB 1 = 1
  fibB n = fibB (n-1) + fibB (n-2)


  fibC :: Int -> Int
  fibC 0 = 0
  fibC 1 = 1
  fibC n
    | n < 0      = error "illegal arguement"
    | otherwise  = fibB (n-1) + fibB (n-2)


  (<##>) :: Int -> Double -> Double
  0 <##> a   = a
  n <##> a  
    | n > 0  = (x + a/x)/2
    | otherwise  = error "illegal arguement"
    where x = (n-1) <##> a
#+end_src

#+RESULTS:
: <interactive>:109:3-7: error: parse error on input ‘where’

** Type conversion1
Guides
#+begin_src haskell
  vielleichtdreifach :: Bool -> Bool -> Integer -> Integer
  vielleichtdreifach verdreifach nochmal n
    | verdreifach && nochmal = maldrei ( maldrei n)
    | verdreifach            = maldrei n
    | otherwise              = n
    where maldrei n = 3*n 

  dreifach :: Integer -> Integer
  dreifach = vielleichtdreifach True False 

  neudreifach :: Integer -> Integer
  neudreifach = vielleichtdreifach True True

#+end_src

#+RESULTS:
: <interactive>:122:15-32: error:
:     Variable not in scope: vielleichtdreifach :: Bool -> Bool -> t

vielleichtdreifach Bool Bool -> Integer

** Factorial
#+begin_src haskell
  fac :: Integer -> Integer
  fac n
    | n == 0  = 1
    | otherwise = fac (n-1) * n
#+end_src

#+RESULTS:
: <interactive>:127:3: error: parse error on input ‘|’

