haskell.org
** Stern Brocot Floge

$\\s_{0} = 0 \\ s_{1} = 1 \\ s_{2n} = s_{n} \\ s_{2n+1} = s_{n} + s_{n+1}$

#+begin_src  haskell
  (*/*) :: Integer -> Integer -> Integer
  (*/*) = div

  (*%*) :: Integer -> Integer -> Integer
  (*%*) = rem

  sternBrocot :: Integer -> Integer
  sternBrocot n
    | n == 0      = 0
    | n == 1      = 1
    | n *%* 2 == 0 = sternBrocot half
    | otherwise    = sternBrocot half + sternBrocot (half + 1)
    where half = n */* 2

  suche :: Integer -> Integer -> Integer
  suche suchziel postionziel
    | sternBrocot postionziel > suchziel = postionziel
    | otherwise                          = suche suchziel (postionziel +1)

#+end_src

#+RESULTS:
: <interactive>:146:3: error: parse error on input ‘|’
* List 
字符串就是单一字符的列表
** List  add
in prelude
#+begin_src haskell
  [1,2,3] ++ [3,4,5]
  2 : [3,4]
#+end_src
* Symbol

需要时刻谨记是用  .  来做函数组合的，$ 是用来降低函数执行优先级的。
